const cateDetails = [
  {
    id: '1',  // 推理
    gameIds: [1, 2, 3]  // 狼人杀, 阿瓦隆, 密室逃脱
  },
  {
    id: '2',  // 社交
    gameIds: [1, 2, 4]  // 狼人杀, 阿瓦隆, 你画我猜
  },
  {
    id: '3',  // 聚会
    gameIds: [1, 2, 4]  // 狼人杀, 阿瓦隆, 你画我猜
  },
  {
    id: '4',  // 剧情
    gameIds: [5, 6]  // 卡坦岛, 大富翁
  },
  {
    id: '5',  // 休闲
    gameIds: [4]  // 你画我猜
  },
  {
    id: '6',  // 策略
    gameIds: [5, 6, 7]  // 卡坦岛, 大富翁, 三国杀
  },
  {
    id: '7',  // 角色扮演
    gameIds: [1, 2, 7]  // 狼人杀, 阿瓦隆, 三国杀
  },
  {
    id: '8',  // 恐怖
    gameIds: [3]  // 密室逃脱
  },
  {
    id: '9',  // 动作
    gameIds: [7]  // 三国杀
  },
  {
    id: '10',  // 生存
    gameIds: [7]  // 三国杀
  },
  {
    id: '11',  // 毛线
    gameIds: [4]  // 你画我猜
  },
  {
    id: '12',  // 德式
    gameIds: [5]  // 卡坦岛
  },
  {
    id: '13',  // 美式
    gameIds: [6]  // 大富翁
  },
  {
    id: '14',  // 合作
    gameIds: [3, 4]  // 密室逃脱, 你画我猜
  },
  {
    id: '15',  // 竞技
    gameIds: [1, 2, 5, 6, 7]  // 狼人杀, 阿瓦隆, 卡坦岛, 大富翁, 三国杀
  },
  {
    id: '16',  // 解谜
    gameIds: [3, 4]  // 密室逃脱, 你画我猜
  },
  {
    id: '17',  // 冒险
    gameIds: [3, 5]  // 密室逃脱, 卡坦岛
  },
  {
    id: '18',  // 卡牌
    gameIds: [7]  // 三国杀
  },
  {
    id: '19',  // 回合制
    gameIds: [5, 6, 7]  // 卡坦岛, 大富翁, 三国杀
  }
]

module.exports = cateDetails